In [2]:
import pandas as pd
import numpy as np#for arrays

dataframe operations on a sample project

In [4]:
journal_data = {
    'day':['03/03/2023','10/03/2023','17/03/2023','18/03/2023','21/03/2023','24/03/2023','28/03/2023'],
    'event':['revenue','purchase','revenue','purchase','revenue','purchase','revenue'],
    'amount':[21000,6000,18000,5000,20000,6000,15000]
}
comdf =pd.DataFrame (journal_data)
comdf

          day     event  amount
0  03/03/2023   revenue   21000
1  10/03/2023  purchase    6000
2  17/03/2023   revenue   18000
3  18/03/2023  purchase    5000
4  21/03/2023   revenue   20000
5  24/03/2023  purchase    6000
6  28/03/2023   revenue   15000

slicing a single column

In [5]:
comdf.amount

0    21000
1     6000
2    18000
3     5000
4    20000
5     6000
6    15000
Name: amount, dtype: int64

In [6]:
comdf.day

0    03/03/2023
1    10/03/2023
2    17/03/2023
3    18/03/2023
4    21/03/2023
5    24/03/2023
6    28/03/2023
Name: day, dtype: object

In [7]:
comdf[['event','amount']]

      event  amount
0   revenue   21000
1  purchase    6000
2   revenue   18000
3  purchase    5000
4   revenue   20000
5  purchase    6000
6   revenue   15000

 summary statistics

In [9]:
comdf.describe()

             amount
count      7.000000
mean   13000.000000
std     7118.052168
min     5000.000000
25%     6000.000000
50%    15000.000000
75%    19000.000000
max    21000.000000

In [8]:
comdf['amount'].max()

21000

conditional statements;select details when your amount was maximum

In [10]:
comdf.loc[comdf['event']=='purchase']

          day     event  amount
1  10/03/2023  purchase    6000
3  18/03/2023  purchase    5000
5  24/03/2023  purchase    6000

In [11]:
comdf.loc[comdf['event']=='revenue']

          day    event  amount
0  03/03/2023  revenue   21000
2  17/03/2023  revenue   18000
4  21/03/2023  revenue   20000
6  28/03/2023  revenue   15000

adding a new column

In [12]:
city=['New York','Denver','Chicago','Boston','New York','Chicago','Denver']
comdf['city']= city

In [13]:
comdf

          day     event  amount      city
0  03/03/2023   revenue   21000  New York
1  10/03/2023  purchase    6000    Denver
2  17/03/2023   revenue   18000   Chicago
3  18/03/2023  purchase    5000    Boston
4  21/03/2023   revenue   20000  New York
5  24/03/2023  purchase    6000   Chicago
6  28/03/2023   revenue   15000    Denver

adding across rows and columns

In [15]:
comdf.sum(axis=1)

C:\Users\user\AppData\Local\Temp\ipykernel_1456\3430198327.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  comdf.sum(axis=1)

0    21000
1     6000
2    18000
3     5000
4    20000
5     6000
6    15000
dtype: int64

# data visualization.
plot a bar graph

In [1]:
import matplotlib.pyplot as plt

In [17]:
plt.plot(event, amount)
plt.title("event against amount")
plt.xlabel("event")
plt.ylabel("amount")
plt.xticks[0,1,2,3,4,5,6,7,8]
plt.yticks[0,2,4,6,8,10,12,14,16,18,20,22,24,26,28]

KeyError: 'revenue'

In [ ]:
revd= [21000,18000,20000,15000]
index= ['Monday','Tuesday','Wednesday','Thursday']
purchase= [6000,5000,4000]